{
  "title": "Khả năng làm việc",
  "html&css1": "Có khả năng tạo trang web tĩnh đáp ứng với giao diện người dùng chuyên nghiệp và hấp dẫn.",
  "html&css2": "Có khả năng xử lý và debug các vấn đề liên quan đến layout, positioning, và trình duyệt compatibility.",
  "html&css3": "Kinh nghiệm sử dụng các công cụ developer để thử nghiệm và tối ưu hoá trang web: Có thể sử dụng các công cụ như Chrome DevTools để kiểm tra và chỉnh sửa code HTML và CSS.",
  "javascript&typescript1": "Kỹ năng lập trình với JavaScript và TypeScript: Có khả năng xây dựng các ứng dụng web tương tác, xử lý sự kiện, và thao tác với DOM.",
  "javascript&typescript2": "Hiểu biết sâu về cú pháp và nguyên tắc lập trình của JavaScript và TypeScript: Có khả năng sử dụng các khái niệm như biến, hàm, toán tử, lập trình hướng đối tượng, promise và async/await.",
  "javascript&typescript3": "Kỹ năng giải quyết vấn đề và debug với JavaScript và TypeScript: Có khả năng tìm ra và sửa lỗi, tối ưu hoá code và hiểu biết về quy tắc kiểm thử (testing) trong lập trình.",
  "javascript&typescript4": "Có kiến thức về công cụ phát triển như Node.js và npm: Có thể sử dụng Node.js để viết mã JavaScript ngoài môi trường trình duyệt, và sử dụng npm để quản lý các gói thư viện và công cụ phụ trợ.",
  "framework1": "Có khả năng xây dựng các giao diện người dùng tương tác, quản lý trạng thái, và tương tác với backend thông qua API.",
  "framework2": "Có thể sử dụng các công cụ và thư viện phổ biến trong hệ sinh thái React như Redux, React Router, và Axios để quản lý state, điều hướng trang, và giao tiếp với backend.",
  "framework3": "Có kiến thức cơ bản về khái niệm và công nghệ liên quan đến React như JSX, component lifecycle, và hooks.",
  "framework4": "Có sự quan tâm và sẵn lòng mở rộng kiến thức để có thể đáp ứng nhu cầu công việc mới cùng với các framework mới như Angular, Vue, hoặc Node.js.",
  "workwithgroup1": "Có thể làm việc cùng các thành viên trong nhóm để đạt được mục tiêu chung và hoàn thành dự án.",
  "workwithgroup2": "Có khả năng thể hiện ý kiến, lắng nghe ý kiến của người khác và giao tiếp một cách rõ ràng và dễ hiểu.",
  "workwithgroup3": "Có thể làm việc và tương tác hiệu quả với các thành viên của nhóm có nguồn gốc và văn hóa đa dạng.",
  "workwithgroup4": "Sẵn lòng chia sẻ kiến thức, kinh nghiệm, và sẵn lòng hỗ trợ các thành viên khác trong nhóm để đạt được mục tiêu chung.",
  "workwithgroup5": "Có khả năng tổ chức công việc một cách hiệu quả, đáp ứng các mục tiêu và thời hạn của dự án."
}
