{
  "title": "Ability to work",
  "html&css1": "Ability to create responsive static websites with professional and attractive user interfaces.",
  "html&css2": "Ability to handle and debug issues related to layout, positioning, and browser compatibility.",
  "html&css3": "I can use tools like Chrome DevTools to test and edit HTML and CSS code.",
  "javascript&typescript1": "Programming skills with JavaScript and TypeScript: Ability to build interactive web applications, handle events, and manipulate the DOM.",
  "javascript&typescript2": "Deep understanding of the syntax and programming principles of JavaScript and TypeScript: Ability to use concepts such as variables, functions, operators, object-oriented programming, promises and async/await.",
  "javascript&typescript3": "Problem solving and debugging skills with JavaScript and TypeScript: Ability to find and fix errors, optimize code and understand testing rules in programming.",
  "javascript&typescript4": "Knowledge of development tools such as Node.js and npm: Can use Node.js to write JavaScript code outside the browser environment, and use npm to manage library packages and backend tools.",
  "framework1": "Ability to build interactive user interfaces, manage state, and interact with the backend through APIs.",
  "framework2": "Can use popular tools and libraries in the React ecosystem such as Redux, React Router, and Axios to manage state, navigate pages, and communicate with the backend.",
  "framework3": "Have basic knowledge of React-related concepts and technologies such as JSX, component lifecycle, and hooks.",
  "framework4": "There is an interest and willingness to expand knowledge to be able to meet new work needs with new frameworks such as Angular, Vue, or Node.js.",
  "workwithgroup": "The ability to work in groups",
  "workwithgroup1": "Can work with group members to achieve common goals and complete projects.",
  "workwithgroup2": "Able to express opinions, listen to others' opinions and communicate clearly and understandably.",
  "workwithgroup3": "Able to work and interact effectively with team members from diverse personalities and cultures.",
  "workwithgroup4": "Willing to share knowledge, experience, and willing to support other group members to achieve common goals.",
  "workwithgroup5": "Able to organize work effectively, meeting project goals and deadlines."
}
